import 'package:hive_flutter/hive_flutter.dart';

class OrderListDB {
  List productsList = [];

  final _myBox = Hive.box('myBox');

  void createInitialData() {
    productsList = [
      "Креветка",
      "Лосось",
      "Крабова паличка",
      "Ікра",
      "Тунець",
      "Вугор",
      "Салат Чука",
      "Манго",
      "Мікс салату",
      "Мікро зелень",
      "Огірок довгий",
      "Кінза",
      "Авокадо",
      "Лимонграс",
      "Листя лайму",
      "Імбир свіжий",
      "Лайм",
      "Рис",
      "Норі",
      "Сир вершковий",
      "Місо паста світла",
      "Хондаші",
      "Кокосове молоко",
      "Кревет. паста",
      "Васабі",
      "Темпура",
      "Вакаме сухі фуеро вакаме",
      "Кунжут",
      "Шічимі",
      "Том Ям паста",
      "Імбир маринований",
      "Чука",
      "Майонез",
      "Унагі соус",
      "Кімчі",
      "Шрірачі",
      "Світ чилі",
      "Рибний соус",
      "Кунжутна олія",
      "Кікоман",
      "Міцукан",
      "Мірін",
      "Соуснички",
      "Палички брендовані",
      "Коробки",
      "Фіксатори для паличок",
      "Вода",
      "палички не брендовані",
      "конбу",
      "маменорі оранж.",
      "дожки для супу",
      "супнички",
    ];
  }

  void loadData() {
    productsList = _myBox.get('ORDERLIST');
  }

  void updateDatabase() {
    _myBox.put('ORDERLIST', productsList);
  }
}
